Public Attributes | List of all members
API_ElemPartSurfaceQuantity Struct Reference
Element Manager API
Describes the different calculated values for surfaces of elements. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Guid  | elemGUID
GUID of the element.
API_AttributeIndex  | materialIndex
Index of the material, that the surface belongs to.
API_AttributeIndex  | buildMatIdx
Building material index of the element, that the surface belongs to.
double  | exposedSurface
Area of exposed surface.
Detailed Description
Describes the different calculated values for surfaces of elements.
Member Data Documentation
◆ buildMatIdx
 API_ElemPartSurfaceQuantity::buildMatIdx
Building material index of the element, that the surface belongs to.
◆ elemGUID
 API_ElemPartSurfaceQuantity::elemGUID
GUID of the element.
◆ exposedSurface
 API_ElemPartSurfaceQuantity::exposedSurface
Area of exposed surface.
◆ materialIndex
 API_ElemPartSurfaceQuantity::materialIndex
Index of the material, that the surface belongs to.